Revit 2027 API
DefaultDivideSettings.PathNumber Property
 A default Divided Path number for a fixed number layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PathNumber { get; set; }
Public Property PathNumber As Integer
	Get
	Set
public:
property int PathNumber {
	int get ();
	void set (int value);
}
member PathNumber : int with get, set
Property Value
Int32
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace